import React from "react";
import book_img from "./book_img";
const data = [
  {
    id: 1,
    title: "คู่มือการเอาตัวรอดของนักกิน เล่ม 3",
    author: "เข่อเล่อเจียงทัง",
    publisher: "อรุณ",
    category: ["นิยายแปล", "นิยายจีนแปล"],
    product_type: "หนังสือ",
    barcode: "11232434343",
    price: 159,
    quantity: 10,
    description: `ใครว่าการทำอาหารมัดใจใครไม่ได้
          บอกเลยว่าเสน่ห์ปลายจวักจะภพชาติไหน
          ก็ย่อมทำได้ทั้งนั้น!
          
          ผลสรุปของการพิสูจน์ตัวผ่านกลิ่นหอมของคลื่นอาหาร
          ของ เจียงซูเหย่า มาถึงแล้ว
          
          คำเตือน : นิยายเรื่องนี้ไม่ควรอ่านช่วงดึกๆ
          เพราะคุณอาจจะนึกคึกไปทำอาหาร
          จนคนที่บ้านต้องตื่นมานั่งกินด้วย
          
          ด้วยฝีมือการปรุงอาหารเลิศรสของเจียงซูเหย่า
          นอกจากจะมัดใจเซี่ยสวิน ผู้เป็นสามีแล้ว
          ยังผูกใจคนในครอบครัวสามีไว้ได้ด้วย
          
          ไม่ว่าปัญหาใดล้วนแก้ไขได้ด้วยอาหารแสนโอชะ
          ทั้งคนสูงศักดิ์และคนธรรมดา
          เมื่อได้ลิ้มลองแล้ว ไม่มีใครที่จะเพิกเฉย`,

    cover_img: book_img[0].cover_img,
    other_img: book_img[0].other_img.map((item) => item),
  },
  {
    id: 2,
    title: "แด่คุณ...ที่อยากให้ทุกอย่างเพอร์เฟกต์",
    author: "อีดงกวี ซนฮาริม และคิมซอยอง",
    publisher: "อมรินทร์ How to",
    category: ["จิตวิทยา การพัฒนาตัวเอง", "การพัฒนาตัวเอง how to"],
    product_type: "หนังสือ",
    barcode: "1f343532",
    price: 199,
    quantity: 10,
    description: `แด่คุณ...ที่อยากให้ทุกอย่างเพอร์เฟกต์

    Four Perfectionists เพอร์เฟกชันนิสต์ 4 แบบในโลกนี้
    
    สีเขียว โหยหาการยอมรับ "ต้องให้ทุกคนชอบ"
    สีเหลือง นักสู้รอบสุดท้าย "รอจนนาทีสุดท้าย"
    สีน้ำเงิน มุ่งสู่ความปลอดภัย "ระวังจนไม่ได้เริ่ม"
    สีแดง มุ่งสู่การเติบโต "พุ่งไปข้างหน้าแบบไม่รู้จักแตะเบรก"
    
    หากคุณเป็นหนึ่งในนั้น และเหนื่อยล้าเกินไปกับการไล่ล่าความไร้ที่ติ
    มาจับจุดแข็ง-จุดอ่อนของตัวเอง หาคำตอบว่า
    ทำไมยิ่งพยายามเข้าใกล้ความสมบูรณ์แบบ เรายิ่งไม่พอใจ
    ทำไมพวกเพอร์เฟกชันนิสต์ชอบเลื่อนส่งงาน
    และเส้นแบ่งระหว่างคนแสวงหาความสมบูรณ์แบบและคนเป็นโรคย้ำคิดย้ำทำ
    (OCD) อยู่ตรงไหน แล้วเปลี่ยนจาก เพอร์เฟกชันนิสต์ติดกับดักตัวเอง ไปเป็น
    เพอร์เฟกชันนิสต์ที่รู้จักตัวเอง และมุ่งหน้าสู่ความยอดเยี่ยมอย่างมีความสุข`,

    cover_img: book_img[1].cover_img,
    other_img: book_img[1].other_img.map((item) => item),
  },
];

export default data;
